{"data":{"type":"contents","id":"ember-inspector/data","attributes":{"content":"You can inspect your models by clicking on the `Data` tab. Check out [Building a Data Custom Adapter](#toc_building-a-data-custom-adapter) below if you maintain your own persistence library. When you open the Data tab, you will see a list of model types defined\nin your application, along with the number of loaded records.\nThe Inspector displays the loaded records when you click on a model type.\n\n<img src=\"/images/guides/ember-inspector/v4.3.4/data-screenshot.png\" width=\"680\"/>\n\n### Inspecting Records\n\nEach row in the list corresponds to one record. The first four model attributes are shown in the list view. Clicking on the record will open the Object Inspector for that record, and display all attributes.\n\n<img src=\"/images/guides/ember-inspector/v4.3.4/data-object-inspector.png\"\nwidth=\"680\"/>\n\n### Record States and Filtering\n\nThe Data tab is kept in sync with the data loaded in your application.\nAny record additions, deletions, or changes are reflected immediately. If you have unsaved\nrecords, they will be displayed in green by clicking on the New pill.\n\n<img src=\"/images/guides/ember-inspector/v4.3.4/data-new-records.png\"\nwidth=\"680\"/>\n\nClick on the Modified pill to display unsaved record modifications.\n\n<img src=\"/images/guides/ember-inspector/v4.3.4/data-modified-records.png\"\nwidth=\"680\"/>\n\nYou can also filter records by entering a query in the search box.\n\n### Building a Data Custom Adapter\n\nYou can use your own data persistence library with the Inspector. Build a [data adapter](https://github.com/emberjs/ember.js/blob/3ac2fdb0b7373cbe9f3100bdb9035dd87a849f64/packages/ember-extension-support/lib/data_adapter.js), and you can inspect your models\nusing the Data tab. Use [Ember Data's data adapter](https://github.com/emberjs/data/blob/d7988679590bff63f4d92c4b5ecab173bd624ebb/packages/ember-data/lib/system/debug/debug_adapter.js) as an example for how to build your data adapter and [DataAdapter](https://api.emberjs.com/ember/release/classes/DataAdapter) documentation.","description":"You can inspect your models by clicking on the Data tab. Check out Building a Data Custom Adapter below if you maintain your own persistence library. When you open the Data tab, you will see a list of model types defined in your application, along with the..."}}}