{"data":{"type":"contents","id":"ember-inspector/troubleshooting","attributes":{"content":"Below are some common issues you may encounter when using the Inspector, along with the\nnecessary steps to solve them. If your issue is not listed below, please submit an\nissue to the Inspector's [GitHub repo](https://github.com/emberjs/ember-inspector).\n\n### Ember Application Not Detected\n\nIf the Inspector cannot detect an Ember application, you will see\nthe following message:\n\n<img\nsrc=\"/images/guides/ember-inspector/troubleshooting-application-not-detected.png\" width=\"350\">\n\nSome of the reasons this may happen:\n\n- This is not an Ember application\n- You are using an old Ember version ( < 1.0 ).\n- You are using a protocol other than HTTP or HTTPS. For file:// protocol,\nfollow [these steps](../installation/#toc_file-protocol).\n- The Ember application is inside a sandboxed iframe with no URL (if you\n  are using JS Bin, follow [these steps](#toc_using-the-inspector-with-js-bin).\n\n### Using the Inspector with JS Bin\n\nDue to the way JS Bin uses iframes, the Inspector doesn't work with edit\nmode. To use the Inspector with JS Bin, switch to the \"live preview\" mode by clicking on\nthe arrow circled below.\n\n<img src=\"/images/guides/ember-inspector/troubleshooting-jsbin.png\" width=\"350\">\n\n### Application is not Detected Without Reload\n\nIf you always have to reload your application after you open the Inspector, that may mean\nthe application's booted state is corrupt. This happens if you call `advanceReadiness` or\n`deferReadiness` after the application has already booted.\n\n### Data Adapter Not Detected\n\nWhen you click on the Data tab, and see this message:\n\n<img src=\"/images/guides/ember-inspector/troubleshooting-data-adapter.png\" width=\"350\">\n\nIt means that the data persistence library you're using does not support the Inspector.\nIf you are the library's author, [see this section](../data/#toc_building-a-data-custom-adapter) on how to add Inspector support to your library.\n\n### Promises Not Detected\n\nYou click on the Promises tab, and see this message:\n\n<img src=\"/images/guides/ember-inspector/troubleshooting-promises-not-detected.png\" width=\"350\">\n\nThis happens if you are using a version of Ember < 1.3.\n\n#### Missing Promises\n\nIf the Promises tab is working, but there are Promises you can't find,\nit's probably because these Promises were created before the\nInspector was activated. To detect Promises the moment the app boots, click on the `Reload` button below:\n\n<img src=\"/images/guides/ember-inspector/v4.3.4/troubleshooting-promises-toolbar.png\" width=\"680\">\n\n#### Inspector Version Old on Firefox\n\nFirefox addons need to go through a review process with each update, so the Inspector is usually one version behind.\n\nUnfortunately we don't have control over the Firefox review process, so if you need\nthe latest Inspector version, download and install it manually from\n[GitHub](https://github.com/emberjs/ember-inspector).","description":"Below are some common issues you may encounter when using the Inspector, along with the necessary steps to solve them. If your issue is not listed below, please submit an issue to the Inspector's GitHub repo. Ember Application Not Detected \n\nIf the..."}}}