{"data":{"type":"contents","id":"configuring-ember/optional-features","attributes":{"content":"One of the ways that Ember releases guarantee stability is by following [Semantic Versioning](https://semver.org/) (SemVer).\nFor the Ember project this means that any feature that is to be removed must first be deprecated,\nand only removed when a major version is released.\nIt also means that new features are introduced in a backwards compatible way.\n\nTo give the project a path forward when a breaking change is mandatory, we've released the [`@ember/optional-features`](https://github.com/emberjs/ember-optional-features) addon.\n\nThis addon does nothing by default, but provides a command-line interface to enable and disable breaking changes in Ember.\n\n## Installation\n\nTo get started with optional features, you must install the addon:\n\n```bash\nember install @ember/optional-features\n```\n\nThis will make three new commands available to Ember CLI within your project, `feature:list`, `feature:enable`, and `feature:disable`.\n\n## Listing features\n\nThe optional features available to your project will depend on the Ember version your project is using.\n\nTo see which optional features are available, you can run the following command:\n\n```bash\n$ ember feature:list\nUsage:\n\n  To list all available features, run ember feature:list.\n  To enable a feature, run ember feature:enable some-feature.\n  To disable a feature, run ember feature:disable some-feature.\n\nAvailable features:\n\n  some-example-feature (Default: true)\n    A description of the feature goes here\n    More information: <link to an RFC>\n```\n\n## Features\n\nOnce you see a feature that you would like to toggle for your project you can run one of two commands, `ember feature:enable <feature>` and `ember feature:disable <feature>`.\n\nLet us disable an optional feature to see what happens. Substitute `some-example-feature`\nfor a real feature name when you run this command.\n\n```bash\n$ ember feature:disable some-example-feature\nDisabled some-example-feature. Be sure to commit config/optional-features.json to source control!\n```\n\nAs we can see from the warning, `@ember/optional-features` has created a file in `config/optional-features.json` to store the configuration for your project.\nWe commit it to our repository and we are off to the races!\n\n<!-- eof - needed for pages that end in a code block  -->","description":"One of the ways that Ember releases guarantee stability is by following Semantic Versioning (SemVer). For the Ember project this means that any feature that is to be removed must first be deprecated, and only removed when a major version is released. It..."}}}