{"data":{"type":"contents","id":"ember-inspector/component-tree","attributes":{"content":"The Components tab displays a collapsible representation of the views and components that are currently being rendered.  Selecting a component from the tree will open it in the [Object Inspector](../object-inspector/). \n\n<img src=\"/images/guides/ember-inspector/v4.3.4/component-tree-intro.png\" width=\"680\">\n\nComponents will be displayed as custom elements with angle brackets.\n\n### Scrolling to a Component in the Browser\n\nClicking the 'markup tag' icon to the right of a component will scroll that component into view in the browser.\n\n<img src=\"/images/guides/ember-inspector/v4.3.4/component-tree-scroll.png\" width=\"333\">\n\n### Expanding and Collapsing Components\n\nComponents can have their children hidden and shown by clicking the caret just to the left of the component.\n\nThe two icons to the left of the search field will expand or collapse all components.\n\n<img src=\"/images/guides/ember-inspector/component-tree-toolbar-expand.png\" width=\"680\">\n\n### Filtering Components\n\nBy typing in the search field you can limit the components that are shown in the tree.\n\n<img src=\"/images/guides/ember-inspector/v4.3.4/component-tree-filtering.png\" width=\"680\">\n\n### Highlighting Templates\n\n#### Hovering over the Component Tree\n\nWhen you hover over the items in the Component Tree, the related component will be\nhighlighted in your app. For every highlighted component, you can see the\ntemplate name and its associated objects.\n\n<img src=\"/images/guides/ember-inspector/v4.3.4/component-tree-hover.png\" width=\"680\">\n\n#### Hovering over the app\n\nIf you want to highlight a component directly within your app, click on the icon to the left of the search bar. As your mouse passes over it, the related component will be\nhighlighted.\n\n<img src=\"/images/guides/ember-inspector/component-tree-toolbar-inspect.png\" width=\"500\">\n\n\nIf you click on a highlighted template or component, the Inspector will select it. You can then\nclick on the backing objects to send them to the object inspector.\n\n<img src=\"/images/guides/ember-inspector/v4.3.4/component-tree-inspect.png\">\n\nClick on the `X` button to deselect a template.","description":"The Components tab displays a collapsible representation of the views and components that are currently being rendered. Selecting a component from the tree will open it in the Object Inspector.  \n\n \n\nComponents will be displayed as custom elements with..."}}}