{"data":{"type":"contents","id":"accessibility/components","attributes":{"content":"When crafting an accessible component, the first and most important thing is that the component should render valid HTML. \n\nBoth the HTML and ARIA specifications have been written in a way that make them work together. Semantic HTML provides the necessary _context_ to screen readers.\n\nBrowsers have implemented the spec in a way that provides functionality for free. \nFor example, consider this code sample: \n\n```html\n<button type=\"submit\">Submit Form</button>\n```\n\nHere is what would be provided by the browser that the developer would otherwise need to provide: \n\n- keyboard interactions on interactive elements (i.e., using the `ENTER` key to activate a `<button>` element)\n- a machine-readable name \n- a place in the `TAB` order of the page\n- the intrinsic role of button \n\nIf the interactive element would be written another way, such as: \n\n```html\n<div>Submit Form</div>\n```\n\nThe developer would need to write the following additional code: \n\n- add the role of button (`role=\"button\"`)\n- add the button to the tab order (`tabindex=\"0\"`)\n- add the keyboard functionality (a JavaScript function to activate the associated action when the `ENTER` key is pressed)\n\nThis is just one example of how developers can use HTML's built in features to improve accessibility and reduce the need for custom code. Read more here: [\"Just use a button\"](https://developer.paciellogroup.com/blog/2011/04/html5-accessibility-chops-just-use-a-button/).\n\n## Focus management in components\n\nFocus is one of the main ways a component can communicate with screen readers.\n\nFor example, when you hit tab on a page or click on a form field, a blue border usually appears around the element. This kind of behavior is part of focus.\nDevelopers can use JavaScript to control the focus in their apps, enabling keyboard navigation and usability by screen readers.\nFor example, if there is a button that launches a modal with interactive elements in it, that button's click handler needs to contain code that brings focus to the new content.\n\nThis article is a good launching point for learning more about focus: [Keyboard accessibility](https://webaim.org/techniques/keyboard/)\n\nHere are some other tips to get you started:\n\n- There is a difference between browse mode and focus mode in screen readers- see [\"Focus Please\"](https://codepen.io/melsumner/live/ZJeYoP).\n- Focus should return from whence it came- for example, if a `<button>` element opens a modal, the focus should then be returned to that same trigger button once the modal is closed. \n- Note: `role=\"presentation\"` or `aria-hidden=\"true\"` should not be used on a focusable element.\n\n\n## Accessible name\n\nAll interactive elements must have an accessible name. But what does that mean, exactly? \n\nBecause the code that is written must be readable by other machines (assistive tech like screen readers, for example), there is documentation about how this accessible name is determined: [Accessible Name and Description Computation](https://www.w3.org/TR/accname-1.1/). \n\nHowever, the most common methods for providing accessible names can be reviewed here. \n\n### Adding a label to an input element\n\nEvery `<input>` element should have an associated `<label>` element. To do this, the `<input>` element's `id` attribute value should be the same as the `for` attribute value on the `<label>`, like this:\n\n![Separate input and label elements with a connection established by matching for and id attributes](/images/accessibility/component-considerations/input-for-id.png)\n\n```html\n<label for=\"input-name\">Name:</label>\n<input id=\"input-name\" name=\"name\" value=\"\" type=\"text\" />\n```\n\nIt is also valid to wrap the `<label>` element around the `<input />` element: \n\n![A child input element nested within a parent label element without any for and id attributes](/images/accessibility/component-considerations/input-nested.png)\n\n```html\n<label>Name:\n  <input name=\"name\" value=\"\" type=\"text\" />\n</label>\n```\n\nHowever, this option can be a little harder to apply styles to, so both should be tested before determining which approach to use.\n\n<div class=\"cta\">\n  <div class=\"cta-note\">\n    <div class=\"cta-note-body\">\n      <div class=\"cta-note-heading\">Zoey says...</div>\n      <div class=\"cta-note-message\">\nTo dig deeper into accessible input patterns in Ember check out the <a href=\"https://emberjs-1.gitbook.io/ember-component-patterns/form-components/input\">ember-component-patterns article on Input Fields</a>.\n      </div>\n    </div>\n    <img src=\"/images/mascots/zoey.png\" role=\"presentation\" alt=\"\">\n  </div>\n</div>","description":"When crafting an accessible component, the first and most important thing is that the component should render valid HTML.  \n\nBoth the HTML and ARIA specifications have been written in a way that make them work together. Semantic HTML provides the necessary..."}}}